[
    {
        "id": 0,
        "dialogue": "Hey, I'm Zack! Welcome to Romeo's Adventure and the land of Code Platoonia. Once a peaceful and prosperous land, Code Platoonia has fallen to the shadows. An evil villain known as 'Zuckerborg' has wreaked havoc and stolen the magical fork of Git. Code Platoonia needs your help. Can you help to restore the balance of Git? ",
        "func": "",
        "anim": true,
        "animation_control": [
          { "html": "dialogue-bg", "anim_add": "elven_2", "anim_remove": "" }
        ],
        "characters": [
          { "add": "zack-forward" }
        ],
        "options": [
            {
                "id": 1,
                "text": "Continue..."
            }
        ]
    },
    {
        "id": 1,
        "dialogue": "Code Platoonia is so grateful for your help! Your name is Romeo. There are many types of brave warriors that study all sorts of disciplines. Some choose to follow the way of Django and learn the power of the backend. Others may choose to follow the ways of React and learn the mysteries of the frontend. A few brave souls embark on a journey to find the balance of both.",
        "func": "",
        "anim": false,
        "animation_control": [],
        "characters": [
          { "add": "zack-forward" }
        ],
        "options": [
            {
                "id": 2,
                "text": "Learn more about Django..."
            }
        ]
    },
    {
        "id": 2,
        "dialogue": "Harnessing the ancient language known as Python, the followers of Django study the ease of syntax, but must be careful to avoid the burn of improper tabs. The all-powerful pass has become a way of life.",
        "func": "",
        "anim": false,
        "animation_control": [],
        "characters": [
          { "add": "backend-forward" },
          { "add": "zack-left" }
        ],
        "options": [
            {
                "id": 3,
                "text": "Learn more about React..."
            }
        ]
    },
    {
        "id": 3,
        "dialogue": "Those who choose the path of React must decipher the type-less scrolls of ancient Platoonian Javascript. The unending questions that forever haunt them are, objects or arrays? To component or to not component? UseEffects, useRefs and Hooks, oh my!",
        "func": "",
        "anim": true,
        "animation_control": [],
        "characters": [
          { "add": "frontend-forward" },
          { "add": "zack-left" }
        ],
        "options": [
            {
                "id": 4,
                "text": "Learn more about Full Stack..."
            }
        ]
    },
    {
        "id": 4,
        "dialogue": "To be a Full Stack is to face the truth and your journey for balance. Trust of the backend views and frontend routes will lead you down a path of harmony. The choice is yours. Proceed to create your Romeo and customize him with 3 spending points.",
        "func": "",
        "anim": true,
        "animation_control": [],
        "characters": [
          { "add": "fullstack-forward" },
          { "add": "zack-left" }
        ],
        "options": [
            {
                "id": 99,
                "text": "Create your character"
            }
        ]
    },
    {
        "id": 99,
        "dialogue": "",
        "func": "newGame",
        "anim": true,
        "animation_control": [
          { "html": "dialogue-bg", "anim_add": "", "anim_remove": "elven_2" }
        ],
        "characters": [],
        "options": [
        ]
    }
]
